[
 {
   "id": 0,
   "storyText": "With a gasp of air, your eyes snap open. You awaken from a nightmare of epic proportions, your skin clammy, your clothes soaked in sweat. You shiver, listening as the dull roar of heavy rain somehow putting a hush to the room. You lay in a four poster canopy bed, its curtains drawn. It is dark, save for the intermittent flashes of lightning. You shiver again, not sure if from the cold or the nightmare. The last thing you remember…",
   "choice1": "Rise and open the curtains.",
   "choice1Destination": 3,
   "choice2": "Try to remember your dream.",
   "choice2Destination": 1,
   "choice3": "Try to think of the last thing you remember.",
   "choice3Destination": 2,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 1,
   "storyText": "The events of the dream are vague, as all dreams are, but you recall the need to move, and with great speed. The desire to run, to get as far away from where you had been, was one of desperation and fear. Were you chasing someone? Was someone or something chasing you? Of this, you cannot be certain. You do know that after a long chase, you feel that you were getting nowhere, dreaming in an endless circle. And so after a feeling of extreme exhaustion and the acceptance that you had been beaten, you decided to give up the struggle, and relent. The fear that arose in the moments before you awoke were beyond any kind of dream you’ve ever had before.",
   "choice1": "Rise and open the curtains.",
   "choice1Destination": 3,
   "choice2": "Try to remember who you are.",
   "choice2Destination": 2,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 2,
   "storyText": "While at first, you find it rather silly to question your own memory, it remains elusive. The last moment you remember with any great clarity is a train ride, an uncomfortable seat, and a key. You were happy, hopeful, the best you felt in years. After that, it gets foggy. You recall the squeak of an iron wrought gate, and a long driveway leading to a loop surrounding a stone fountain. You see a great shadow against a dark sky, a white front door. And after that, nothing. You fight off a sense of panic as your mind whirls. The memories feel like so long ago, yet there is nothing in your mind until right now. You try to remember, again and again, but it seems the harder you try, the less you understand. How much time occurred from now and then? And where exactly are you? You are resigned to the fact that as of this moment, you simply have no answers.",
   "choice1": "Rise and open the curtains.",
   "choice1Destination": 3,
   "choice2": "Try to remember your dream.",
   "choice2Destination": 1,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 3,
   "storyText": "You open the curtains of the canopy bed on the left side. It takes a bit of effort to get your legs to the carpeted floor. Your muscles feel slow and sluggish. You fight off a feeling of light-headedness when you stand. A flash of lightning gives depth to the room, though its thunder shakes you to your very core. You are in a large bedroom with high ceilings. There is another canopy bed on the opposite side of the room, giving it a sort of a symmetry. In front of you is a row of windows, with heavy rain pounding on the glass. To the right of that is a dresser with a vanity mirror. To the left, a large wooden armoire. There is a small door on the left wall, and a larger door behind you. They are both closed.",
   "choice1": "Try the smaller door.",
   "choice1Destination": 4,
   "choice2": "Try the larger door.",
   "choice2Destination": 16,
   "choice3": "Blindly search the walls for a light switch.",
   "choice3Destination": 17,
   "choice4": "Look out the window.",
   "choice4Destination": 18
 },
 {
   "id": 4,
   "storyText": "The door groans open.You see complete darkness.",
   "choice1": "Listen.",
   "choice1Destination": 5,
   "choice2": "Search for a light switch.",
   "choice2Destination": 6,
   "choice3": "Head back to the bedroom.",
   "choice3Destination": 7,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 5,
   "storyText": "It is quiet, eerily so. The sound of the rain is bringing back echoes. There is also a dripping of water, though you cannot pinpoint where.",
   "choice1": "Look for a light switch.",
   "choice1Destination": 6,
   "choice2": "Head back into the bedroom.",
   "choice2Destination": 7,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 6,
   "storyText": "Off to the left of the door, your hands fumble around a light switch.",
   "choice1": "Flip the switch.",
   "choice1Destination": 8,
   "choice2": "Head back into the bedroom.",
   "choice2Destination": 7,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 7,
   "storyText": "Unwilling to confront any more darkness, you head back into the bedroom, closing the door behind you.",
   "choice1": "Try the larger door in the room.",
   "choice1Destination": 16,
   "choice2": "Look for a light switch in the bedroom.",
   "choice2Destination": 17,
   "choice3": "Look out the window.",
   "choice3Destination": 18,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 8,
   "storyText": "A single bulb switches on an ornate light fixture above a tall sink with two faucets. You see a claw footed tub in the far corner of the room with a curtain drawn, and a toilet with a pull chain to the right of it. The floor is checkered with black and white square tiles, the walls of simple white plaster. The bathroom looks like it hasn’t been used in years. The drip, as far as you can tell, is coming from behind the curtain.",
   "choice1": "Try the sink.",
   "choice1Destination": 9,
   "choice2": "Flush the toilet.",
   "choice2Destination": 10,
   "choice3": "Peer behind the curtain.",
   "choice3Destination": 11,
   "choice4": "Head back into the bedroom.",
   "choice4Destination": 15
 },
 {
   "id": 9,
   "storyText": "You turn both faucets. The pipes groan, but no water comes out.",
   "choice1": "Flush the toilet.",
   "choice1Destination": 10,
   "choice2": "Peer behind the curtain.",
   "choice2Destination": 11,
   "choice3": "Head back into the bathroom.",
   "choice3Destination": 15,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 10,
   "storyText": "You pull the toilet chain. There is a gurgle coming from beyond the wall, but other than that, the toilet does not flush.",
   "choice1": "Try the sink.",
   "choice1Destination": 9,
   "choice2": "Peer behind the curtain.",
   "choice2Destination": 11,
   "choice3": "Head back into the bedroom.",
   "choice3Destination": 15,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 11,
   "storyText": "You walk to the tub. The curtain is white, though dull and drab both from age and use. You feel suddenly uneasy. The hairs on the back of your neck prickle. You don’t know why or how, but you feel like something bad happened behind this curtain, perhaps something terrible. With great reluctance, you pull the shower curtain off to the side. The tub is filled halfway with murky brown water. An inconstant drip falls from the faucet. A chain for the plug is tightly secured around it, the plug no doubt clogging the mire.",
   "choice1": "Pull the plug.",
   "choice1Destination": 12,
   "choice2": "Leave it alone.",
   "choice2Destination": 13,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 12,
   "storyText": "There is a bit of resistance as you tug the plug loose with the chain. The water drains, though with little haste. Its echo reverberates throughout the entire room. As you study the mucky water, you suddenly feel as though you are not alone anymore. Through the sound of the draining water, you are almost certain you make out a gasp for breath, and a woman’s voice. And the words, though quiet, were clear. HELP ME. Goosebumps cover your skin. You shiver.",
   "choice1": "Step away from the tub.",
   "choice1Destination": 13,
   "choice2": "Wait for the water to empty.",
   "choice2Destination": 14,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 13,
   "storyText": "A flash of lightning blinds you. Thunder roars. There is a low pop as the bathroom bulb burns out. You are left in the darkness.",
   "choice1": "Head back to the bedroom.",
   "choice1Destination": 15,
   "choice2": "",
   "choice2Destination": null,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 14,
   "storyText": "It takes several minutes before the water drains completely. There is a visible stain from the original waterline down to the bottom. Even in the discoloration, you are able to make out sharp gashes and chips out of the porcelain in the very center of the tub. Some chips go half an inch deep.",
   "choice1": "Head back to the bedroom.",
   "choice1Destination": 15,
   "choice2": "",
   "choice2Destination": null,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 15,
   "storyText": "You walk back into the bedroom.",
   "choice1": "Try the larger door.",
   "choice1Destination": 16,
   "choice2": "Look for a light switch in the bedroom.",
   "choice2Destination": 17,
   "choice3": "Look out the window.",
   "choice3Destination": 18,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 16,
   "storyText": "You reach for the knob and try to turn it. It is locked.",
   "choice1": "Look for a light switch.",
   "choice1Destination": 16,
   "choice2": "Try the smaller door.",
   "choice2Destination": 4,
   "choice3": "Look out the window.",
   "choice3Destination": 18,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 17,
   "storyText": "In the darkness, you are able to make out a light switch next to the large door. You flip the switch. An ornate glass light fixture hanging from the ceiling illuminates the room. The rug is green, matching the green tangles of ivy plants and vines that adorn the expensive looking wallpaper, which in turn match the curtains hanging from the canopy beds. In all, it is a very classy room, and it is clear no expense was spared in its decor when originally furnished. There is a certain familiarity about the room, though you cannot say for certain that you hold and specific memory of it. On the green carpet, between the vanity and the large door, is a hardcover book that lay face down.",
   "choice1": "Pick up the book.",
   "choice1Destination": 19,
   "choice2": "",
   "choice2Destination": null,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 18,
   "storyText": "You peer out the window. Rain is coming down in sheets. A flash of lightning reveals a large manicured lawn severed in half by a narrow drive leading up to a loop that surrounds a stone fountain. Your heart sinks.",
   "choice1": "Try the smaller door.",
   "choice1Destination": 4,
   "choice2": "Try the larger door.",
   "choice2Destination": 16,
   "choice3": "Look for a light switch.",
   "choice3Destination": 17,
   "choice4": "Pick up the book.",
   "choice4Destination": 19
 },
 {
   "id": 19,
   "storyText": "You reach down to pick up the book, or rather merely the hardcover binding of what was once a book. The cover reads merely, “Diary.” As you open the cover, a single sheet of paper dangles from its spine. It is covered both front and back in beautiful handwritten scrawl.",
   "choice1": "Drop the book.",
   "choice1Destination": 20,
   "choice2": "Read the page.",
   "choice2Destination": 21,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 },
 {
   "id": 20,
   "storyText": "You drop the book. It unceremoniously falls to the floor in the same place.",
   "choice1": "Read the page after all.",
   "choice1Destination": 21,
   "choice2": "Try the smaller door.",
   "choice2Destination": 4,
   "choice3": "Look out the window.",
   "choice3Destination": 18,
   "choice4": "Try the larger door.",
   "choice4Destination": 16
 },
 {
   "id": 21,
   "storyText": "NEW SECTION",
   "choice1": "Start over",
   "choice1Destination": 0,
   "choice2": "",
   "choice2Destination": null,
   "choice3": "",
   "choice3Destination": null,
   "choice4": "",
   "choice4Destination": null
 }
]